Repository: MAGHPMallawaarachchi/mealtime
Catalog: lib/l10n/app_*.arb
Languages: si

# appTitle
source: MealTime
si: ආහාර වේලාව

source: Today's Meal Plan
si: අද ආහාර සැලැස්ම

source: See All
si: සියල්ල බලන්න

# noMealsPlanned
source: No meals planned yet
si: තවම ආහාර සැලසුම් කර නැත

# startPlanningMeals
source: Tap "See All" to start planning your meals
si: ආහාර සැලසුම් කිරීම ආරම්භ කිරීමට "සියල්ල බලන්න" ක්ලික් කරන්න

source: Settings
si: සැකසුම්

source: Language
si: භාෂාව

source: App Language
si: යෙදුම භාෂාව

source: English
si: ඉංග්‍රීසි

source: Sinhala
si: සිංහල

source: Household
si: ගෘහස්ථය

source: Household Size
si: ගෘහස්ථ ප්‍රමාණය

source: Dietary Preferences
si: ආහාර මනාපයන්

source: Dietary Preference
si: ආහාර මනාපය

source: Non-Vegetarian
si: මස් භක්ෂක

source: Vegetarian
si: නිර්මාංශිත

source: Vegan
si: සම්පූර්ණ ශාක ආහාර

source: Pescatarian
si: මත්ස්‍ය භක්ෂක

source: Recipe Recommendations
si: වට්ටෝරු නිර්දේශ

source: Prioritize Pantry Items
si: ගබඩා ද්‍රව්‍ය ප්‍රමුඛතාව

# prioritizePantryDescription
source: When enabled, recipes using ingredients from your pantry will be prioritized in recommendations
si: සක්‍රීය කළ විට, ඔබේ ගබඩාවේ ඇති අමුද්‍රව්‍ය භාවිතා කරන වට්ටෝරුවලට නිර්දේශවල ප්‍රමුඛතාව ලැබෙනු ඇත

source: Notifications
si: දැනුම් දීම්

source: Meal Plan Reminders
si: ආහාර සැලැස්ම සිහිකැඳවීම්

# mealPlanRemindersDescription
source: Get reminded about your planned meals
si: ඔබේ සැලසුම් කළ ආහාර ගැන සිහිකැඳවීම් ලබා ගන්න

source: Shopping List Updates
si: සාප්පු ලැයිස්තු යාවත්කාලීන

# shoppingListUpdatesDescription
source: Get notified when shopping list changes
si: සාප්පු ලැයිස්තුව වෙනස් වන විට දැනුම් ලබා ගන්න

source: Save Settings
si: සැකසුම් සුරකින්න

source: Settings saved successfully
si: සැකසුම් සාර්ථකව සුරකින ලදී

source: In Season
si: මේ කාලේ බහුල

source: Perfect
si: පරිපූර්ණයි

source: Good
si: හොඳයි

source: Item
si: අයිතමය

source: Items
si: අයිතම

# failedToSaveSettings
source: Failed to save settings: {error}
si: සැකසුම් සුරැකීම අසාර්ථක විය: {error}

# errorLoadingPreferences
source: Error loading preferences: {error}
si: මනාපයන් පැටවීමේ දෝෂය: {error}

source: Perfect for Your Pantry
si: ඔබේ ගබඩාවට සුදුසු

# useUpPantryItems
source: Use up your pantry items
si: ඔබේ ගබඩා ද්‍රව්‍ය භාවිතා කරන්න

source: Just for You
si: ඔබ සඳහා පමණි

# basedOnPreferences
source: Based on your preferences
si: ඔබේ මනාපයන් මත පදනම් වූ

source: Quick Weeknight Meals
si: ඉක්මන් සතියේ දින ආහාර

# readyInMinutes
source: Ready in 30 minutes or less
si: මිනිත්තු 30කට වඩා අඩු කාලයකින් සූදානම්

source: Seasonal Favorites
si: කාලීන ප්‍රියතම

source: Seasonal Spotlight
si: කාලීන අමුද්‍රව්‍ය

# perfectForTimeOfYear
source: Perfect for this time of year
si: වර්ෂයේ මෙම කාලයට සුදුසු

source: No pantry matches found
si: ගබඩා ගැලපීම් හමු නොවීය

# addItemsToGetSuggestions
source: Add items to your pantry to get recipe suggestions
si: වට්ටෝරු යෝජනා ලබා ගැනීමට ඔබේ ගබඩාවට අයිතම එක් කරන්න

source: Building your preferences
si: ඔබේ මනාපයන් ගොඩනගමින්

# interactToGetSuggestions
source: Interact with recipes to get personalized suggestions
si: පුද්ගලික යෝජනා ලබා ගැනීමට වට්ටෝරු සමග අන්තර්ක්‍රියා කරන්න

source: No quick meals available
si: ඉක්මන් ආහාර නොමැත

# quickMealSuggestions
source: Quick meal suggestions will appear here
si: ඉක්මන් ආහාර යෝජනා මෙහි දිස්වෙනු ඇත

source: No seasonal recipes found
si: කාලීන වට්ටෝරු හමු නොවීය

# seasonalRecommendations
source: Seasonal recommendations based on current time of year
si: වර්ෂයේ වර්තමාන කාලය මත පදනම් වූ කාලීන නිර්දේශ

source: Personalized recommendations
si: පුද්ගලික නිර්දේශ

# addItemsAndSetPreferences
source: Add items to your pantry and set your preferences to get personalized recipe recommendations.
si: පුද්ගලික වට්ටෝරු නිර්දේශ ලබා ගැනීමට ඔබේ ගබඩාවට අයිතම එක් කර ඔබේ මනාපයන් සකසන්න.

source: Unable to load recommendations
si: නිර්දේශ පැටවීමට නොහැකිය

# checkConnectionAndRetry
source: Please check your connection and try again.
si: කරුණාකර ඔබේ සම්බන්ධතාවය පරීක්ෂා කර නැවත උත්සාහ කරන්න.

source: Retry
si: නැවත උත්සාහ කරන්න

source: No Image
si: පින්තූරයක් නැත

source: Good Morning
si: සුභ උදෑසනක්

source: Good Afternoon
si: සුභ දවහලක්

source: Good Evening
si: සුභ සන්ධ්‍යාවක්

source: Guest User
si: අමුත්තන් පරිශීලකයා

source: Notifications coming soon!
si: දැනුම්දීම් ඉක්මනින් පැමිණේ!

source: Home
si: මුල් පිටුව

source: Explore
si: ගවේෂණය

source: Pantry
si: ගබඩාව

source: Meal Planner
si: ආහාර සැලසුම්කරු

source: Profile
si: පැතිකඩ

source: Search recipes, ingredients...
si: වට්ටෝරු, අමුද්‍රව්‍ය සොයන්න...

source: Something went wrong
si: කිසියම් දෝෂයක් සිදු වී ඇත

source: Try Again
si: නැවත උත්සාහ කරන්න

source: Recipes
si: වට්ටෝරු

# addedToFavorites
source: {recipeName} added to favorites!
si: {recipeName} ප්‍රියතමයන්ට එක් කරන ලදී!

# removedFromFavorites
source: {recipeName} removed from favorites
si: {recipeName} ප්‍රියතමයන්ගෙන් ඉවත් කරන ලදී

source: Undo
si: අවලංගු කරන්න

# addedToMealPlan
source: {recipeName} added to meal plan
si: {recipeName} ආහාර සැලැස්මට එක් කරන ලදී

source: My Pantry
si: මගේ ගබඩාව

source: Ingredients
si: අමුද්‍රව්‍ය

source: Leftovers
si: ඉතිරි ආහාර

# ingredientsCount
source: {count} ingredients
si: අමුද්‍රව්‍ය {count}ක්

# leftoversCount
source: {count} leftovers
si: ඉතිරි ආහාර {count}ක්

source: Delete Ingredient
si: අමුද්‍රව්‍ය මකන්න

# confirmDeleteIngredient
source: Are you sure you want to remove "{itemName}" from your pantry?
si: ඔබට "{itemName}" ඔබේ ගබඩාවෙන් ඉවත් කිරීමට අවශ්‍ය බව ඇත්තද?

source: Cancel
si: අවලංගු කරන්න

source: Delete
si: මකන්න

source: Loading your pantry...
si: ඔබේ ගබඩාව පූරණය වෙමින්...

source: Failed to Load Pantry
si: ගබඩාව පූරණය කිරීම අසාර්ථක විය

source: No Ingredients Yet
si: තවම අමුද්‍රව්‍ය නැත

# addFreshIngredientsDiscover
source: Add fresh ingredients to discover recipes you can make!
si: ඔබට සාදා ගත හැකි වට්ටෝරු සොයා ගැනීමට නැවුම් අමුද්‍රව්‍ය එක් කරන්න!

source: Add Ingredient
si: අමුද්‍රව්‍ය එක් කරන්න

source: Quick Add Popular Items:
si: ජනප්‍රිය අයිතම ඉක්මනින් එක් කරන්න:

source: No Leftovers Yet
si: තවම ඉතිරි ආහාර නැත

# addLeftoverFoodItems
source: Add leftover food items to find creative ways to use them up!
si: ඒවා භාවිතා කිරීමේ නිර්මාණශීලී ක්‍රම සොයා ගැනීමට ඉතිරි ආහාර අයිතම එක් කරන්න!

source: Add Leftover
si: ඉතිරි ආහාර එක් කරන්න

source: Common leftovers to track:
si: ට්‍රැක් කිරීමට පොදු ඉතිරි ආහාර:

# planYourMealsFlexibility
source: Plan your meals with flexibility
si: ඔබේ ආහාර සැලසුම් කරන්න

source: Add Meal
si: ආහාරය එක් කරන්න

source: Custom Meal
si: අභිරුචි ආහාරය

source: Add Custom Meal
si: අභිරුචි ආහාරය එක් කරන්න

source: Meal Name
si: ආහාර නම

source: Enter meal name
si: ආහාර නම ඇතුළත් කරන්න

source: Add
si: එක් කරන්න

source: Edit Meal
si: ආහාරය සංස්කරණය කරන්න

source: Lock Meal
si: ආහාරය අගුළු දමන්න

source: Unlock Meal
si: ආහාරය අගුළු ඇරින්න

source: Remove Meal
si: ආහාරය ඉවත් කරන්න

# confirmRemoveMeal
source: Are you sure you want to remove "{mealName}"?
si: ඔබට "{mealName}" ඉවත් කිරීමට අවශ්‍ය බව ඇත්තද?

source: Remove
si: ඉවත් කරන්න

source: Breakfast
si: උදේ ආහාරය

source: Lunch
si: දවල් ආහාරය

source: Dinner
si: රාත්‍රී ආහාරය

source: Snack
si: ස්නැක්ස්

source: Brunch
si: බ්‍රන්ච්

source: Late Night
si: රාත්‍රියේ පසුව

source: Adding meal...
si: ආහාරය එක් කරමින්...

# mealAddedSuccessfully
source: {mealName} added successfully!
si: {mealName} සාර්ථකව එක් කරන ලදී!

source: Meal updated successfully!
si: ආහාරය සාර්ථකව යාවත්කාලීන කරන ලදී!

source: Meal deleted
si: ආහාරය මකන ලදී

# openingMeal
source: Opening {mealName}...
si: {mealName} විවෘත කරමින්...

# noRecipeAvailable
source: No recipe available for this meal
si: මෙම ආහාරය සඳහා වට්ටෝරුවක් නොමැත

source: Close
si: වසන්න

source: View Recipes
si: වට්ටෝරු බලන්න

source: Failed to load more recipes
si: තවත් වට්ටෝරු පූරණය කිරීම අසාර්ථක විය

source: You have seen all recipes
si: ඔබ සියලුම වට්ටෝරු දැක්කා

source: Loading more recipes...
si: තවත් වට්ටෝරු පූරණය වෙමින්...

source: Load More Recipes
si: තවත් වට්ටෝරු පූරණය කරන්න

source: No recipes found for this ingredient
si: මෙම අමුද්‍රව්‍ය සඳහා වට්ටෝරු හමු නොවීය

# checkBackLater
source: Check back later as we add more seasonal recipes to our collection.
si: අපගේ එකතුවට තවත් සෘතුමය වට්ටෝරු එකතු කරන බැවින් පසුව නැවත පරීක්ෂා කරන්න.

source: Refresh
si: නැවුම් කරන්න

source: Recipe Not Found
si: වට්ටෝරුව හමු නොවීය

source: Failed to load
si: පූරණය කිරීම අසාර්ථක විය

source: Perfect for your {items}
si: ඔබේ {items} සඳහා සුදුසුයි

# usesIngredientsFromPantry
source: Uses ingredients from your pantry
si: ඔබේ ගබඩාවේ අමුද්‍රව්‍ය භාවිතා කරයි

source: Based on your preferences
si: ඔබේ මනාපයන් මත පදනම් වූ

# similarToPreferences
source: Similar to your preferences
si: ඔබේ මනාපයන්ට සමාන

source: Perfect for this season
si: මේ කාලයට සුදුසුයි

source: Quick and easy
si: ඉක්මන් සහ පහසු

# similarToEnjoyedRecipes
source: Similar to recipes you've enjoyed
si: ඔබ රස විඳින වට්ටෝරුවලට සමාන

source: Perfect match!
si: සම්පූර්ණ ගැලපීමක්!

source: Great match!
si: විශිෂ්ට ගැලපීමක්!

# usesPantryIngredients
source: Uses {count} {count, plural, =1{ingredient} other{ingredients}} from your pantry
si: ඔබේ ගබඩාවේ අමුද්‍රව්‍ය {count}ක් භාවිතා කරයි

source: Finding recipes...
si: වට්ටෝරු සොයමින්...

# failedToLoadCurrentSeasonalIngredients
source: Failed to load current seasonal ingredients. Please try again.
si: වර්තමාන කාලීන අමුද්‍රව්‍ය පූරණය කිරීම අසාර්ථක විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Failed to refresh
si: නැවුම් කිරීම අසාර්ථක විය

source: Loading current seasonal ingredients...
si: වර්තමාන කාලීන අමුද්‍රව්‍ය පූරණය වෙමින්...

# noIngredientsInPeakSeason
source: No ingredients are in peak season right now. Check back later!
si: දැන් කිසිදු අමුද්‍රව්‍යයක් පිරිමුළුන් කාලයේ නොමැත. පසුව නැවත පරීක්ෂා කරන්න!

source: Unknown error occurred
si: නොදන්නා දෝෂයක් සිදු වී ඇත

source: Categories
si: වර්ග

source: All
si: සියල්ල

source: Beverages
si: පාන

source: Snacks
si: කෙටි ආහාර

source: Desserts
si: අමුළු කෑම

source: All Recipes
si: සියලුම වට්ටෝරු

source: Personalized
si: පුද්ගලීකරණය

# loadingMoreRecipesEllipsis
source: Loading more recipes...
si: තවත් වට්ටෝරු පූරණය වෙමින්...

source: Failed to load recipes
si: වට්ටෝරු පූරණය කිරීම අසාර්ථක විය

# recipesSortedByPreferences
source: {count} recipes, sorted by your preferences
si: වට්ටෝරු {count}ක්, ඔබේ මනාපයන්ට අනුව සකසන ලද

# recipesFound
source: {count} recipes found
si: වට්ටෝරු {count}ක් හමු විය

source: No {category} recipes yet
si: {category} වට්ටෝරු තවම නැත

# checkBackLaterForNewRecipes
source: Check back later for new recipes featuring this ingredient.
si: නව වට්ටෝරු සඳහා පසුව නැවත පරීක්ෂා කරන්න

source: No recipes available yet
si: තවම වට්ටෝරු නොමැත

source: Check back later for delicious recipes
si: රසවත් වට්ටෝරු සඳහා පසුව නැවත පරීක්ෂා කරන්න

source: Error loading recipes
si: වට්ටෝරු පූරණය කිරීමේ දෝෂය

source: Loading recipes...
si: වට්ටෝරු පූරණය වෙමින්...

# recipesFoundCount
source: {count, plural, =1{1 recipe} other{{count} recipes}} found
si: වට්ටෝරු {count}ක් හමු විය

# showingRecipesCount
source: Showing {displayed} of {total, plural, =1{1 recipe} other{{total} recipes}}
si: වට්ටෝරු {total}න් {displayed}ක් පෙන්වමින්

# recipeDoesNotExist
source: The recipe you are looking for does not exist.
si: ඔබ සොයන වට්ටෝරුව නොමැත.

source: View Less
si: අඩුවෙන් බලන්න

source: View More
si: තවත් බලන්න

source: Instructions
si: උපදෙස්

source: Servings
si: සේවා කිරීම්

source: Cups
si: කෝප්ප

source: Metric
si: මෙට්‍රික්

source: Calories
si: කැලරි

source: Protein
si: ප්‍රෝටීන්

source: Carbs
si: කාබෝ

source: Fat
si: මේදය

source: Add to Meal Plan
si: ආහාර සැලැස්මට එක් කරන්න

# addRecipeToMealPlan
source: Add "{recipeTitle}" to Meal Plan
si: "{recipeTitle}" ආහාර සැලැස්මට එක් කරන්න

source: Go to Meal Planner
si: ආහාර සැලසුම්කරුවට යන්න

# chooseSpecificDayAndMeal
source: Choose specific day and meal time
si: නිශ්චිත දිනය සහ ආහාර වේලාව තෝරන්න

source: Add to Today
si: අදට එක් කරන්න

# quickAddToTodayMeal
source: Quick add to next available meal today
si: අදට ඉක්මනින් ලබා ගත හැකි ආහාරයට එක් කරන්න

# whichMealToAdd
source: Which meal would you like to add "{recipeTitle}" to?
si: "{recipeTitle}" කුමන ආහාරයට එක් කිරීමට ඔබට අවශ්‍යද?

# addedToTodayMeal
source: Added to today's {mealType}!
si: අදේ {mealType}ට එක් කරන ලදී!

# breakfastTime
source: 8:30 AM
si: උදේ 8:30ට

# lunchTime
source: 12:30 PM
si: දවල් 12:30ට

# dinnerTime
source: 7:00 PM
si: සවස 7:00ට

# pleaseLoginToViewMealPlans
source: Please login to view your meal plans
si: ආහාර සැලැස්ම බැලීමට කරුණාකර ඇතුළු වන්න

source: Failed to load meal plan
si: ආහාර සැලැස්ම පූරණය කිරීම අසාර්ථක විය

# youDoNotHavePermission
source: You do not have permission to access meal plans
si: ඔබට ආහාර සැලැස්ම වෙත ප්‍රවේශ වීමට අවසර නැත

# networkError
source: Network error. Please check your connection
si: ජාල දෝෂයකි. කරුණාකර ඔබේ සම්බන්ධතාව පරීක්ෂා කරන්න

# serviceUnavailable
source: Service is currently unavailable
si: සේවාව දැනට ලබා ගත නොහැකිය

source: Auto-fill Week
si: සතිය ස්වයංක්‍රීයව පුරන්න

# autoFillWeekDescription
source: Automatically fill empty meal slots with suggestions based on your pantry, leftovers, and seasonal recipes?
si: ඔබේ ගබඩාව, ඉතිරි ආහාර සහ සෘතුමය වට්ටෝරු මත පදනම්ව හිස් ආහාර කාල සඳහා ස්වයංක්‍රීයව යෝජනා පුරවන්නද?

source: Auto-fill feature coming soon!
si: ස්වයංක්‍රීය පිරවීමේ විශේෂාංගය ඉක්මනින් පැමිණේ!

source: View Previous Weeks
si: පෙර සති බලන්න

source: Duplicate Week
si: සතිය අනුපිටපත් කරන්න

source: Clear All Meals
si: සියලුම ආහාර මකන්න

source: Please login to add meals
si: ආහාර එක් කිරීමට කරුණාකර ඇතුළු වන්න

# mealCategoryRequired
source: Meal category is required
si: ආහාර කාණ්ඩය අවශ්‍ය වේ

source: Please login to update meals
si: ආහාර යාවත්කාලීන කිරීමට කරුණාකර ඇතුළු වන්න

# failedToUpdateMeal
source: Failed to update meal: {error}
si: ආහාරය යාවත්කාලීන කිරීම අසාර්ථක විය: {error}

source: Please login to delete meals
si: ආහාර මකා දැමීමට කරුණාකර ඇතුළු වන්න

# failedToDeleteMeal
source: Failed to delete meal: {error}
si: ආහාරය මකා දැමීම අසාර්ථක විය: {error}

# failedToOpenRecipe
source: Failed to open recipe. Please try again.
si: වට්ටෝරුව විවෘත කිරීම අසාර්ථක විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: You do not have permission to add meals
si: ඔබට ආහාර එක් කිරීමට අවසර නැත

# networkErrorCheckConnection
source: Network error. Please check your connection and try again
si: ජාල දෝෂයකි. කරුණාකර ඔබේ සම්බන්ධතාව පරීක්ෂා කර නැවත උත්සාහ කරන්න

# serviceUnavailableTryLater
source: Service is currently unavailable. Please try again later
si: සේවාව දැනට ලබා ගත නොහැකිය. කරුණාකර පසුව නැවත උත්සාහ කරන්න

source: No meal plan available
si: ආහාර සැලැස්මක් නොමැත

# addMealsWithRecipes
source: Please add meals with recipes to generate a grocery list.
si: සිල්ලර ලැයිස්තුවක් ජනනය කිරීමට කරුණාකර වට්ටෝරු සහිත ආහාර එක් කරන්න.

# noMealsPlannedForGrocery
source: No meals planned
si: ආහාර සැලසුම් කර නැත

# addMealsToMealPlan
source: Add meals to your meal plan first, then generate a grocery list.
si: මුලින්ම ඔබේ ආහාර සැලැස්මට ආහාර එක් කරන්න, පසුව සිල්ලර ලැයිස්තුවක් ජනනය කරන්න.

source: No recipe-based meals
si: වට්ටෝරු මත පදනම් වූ ආහාර නැත

# addMealsWithRecipesForGrocery
source: Add meals with recipes to generate ingredients for your grocery list.
si: ඔබේ සිල්ලර ලැයිස්තුව සඳහා අමුද්‍රව්‍ය ජනනය කිරීමට වට්ටෝරු සහිත ආහාර එක් කරන්න.

source: Generating grocery list...
si: සිල්ලර ලැයිස්තුව ජනනය කරමින්...

# analyzingMealPlan
source: Analyzing your meal plan and calculating ingredients
si: ඔබේ ආහාර සැලැස්ම විශ්ලේෂණය කර අමුද්‍රව්‍ය ගණනය කරමින්

source: Grocery List Generation Failed
si: සිල්ලර ලැයිස්තු ජනනය අසාර්ථක විය

source: This Week
si: මෙම සතිය

# mealsPlanned
source: {count} meals planned
si: ආහාර {count}ක් සැලසුම් කර ඇත

# mondayShort
source: M
si: ස

# tuesdayShort
source: T
si: අ

# wednesdayShort
source: W
si: බ

# thursdayShort
source: T
si: බ්‍ර

# fridayShort
source: F
si: සි

# saturdayShort
source: S
si: සෙ

# sundayShort
source: S
si: ඉ

source: Today
si: අද

source: Monday
si: සඳුදා

source: Tuesday
si: අඟහරුවාදා

source: Wednesday
si: බදාදා

source: Thursday
si: බ්‍රහස්පතින්දා

source: Friday
si: සිකුරාදා

source: Saturday
si: සෙනසුරාදා

source: Sunday
si: ඉරිදා

source: Unknown
si: නොදන්නා

source: meals
si: ආහාර

# noMealsPlannedEmpty
source: No meals planned
si: ආහාර සැලසුම් කර නැත

# tapPlusButtonToAddMeal
source: Tap the + button in navigation to add your first meal
si: ඔබේ පළමු ආහාරය එක් කිරීමට නාවිකයේ + බොත්තම ක්ලික් කරන්න

source: Select Time
si: වේලාව තෝරන්න

# selectNewTimeForMeal
source: Select new time for your meal
si: ඔබේ ආහාරය සඳහා නව වේලාවක් තෝරන්න

# chooseTimeForMeal
source: Choose time for {mealCategory}
si: {mealCategory} සඳහා වේලාව තෝරන්න

source: Selected Time
si: තෝරාගත් වේලාව

source: Quick Select
si: ඉක්මන් තේරීම

source: Custom Time
si: අභිරුචි වේලාව

source: Next
si: ඊළඟ

source: Confirm
si: තහවුරු කරන්න

source: Select Recipe
si: වට්ටෝරුව තෝරන්න

# chooseRecipeForMeal
source: Choose a recipe for your meal
si: ඔබේ ආහාරය සඳහා වට්ටෝරුවක් තෝරන්න

# loadingRecipesEllipsis
source: Loading recipes...
si: වට්ටෝරු පූරණය වෙමින්...

# searchFailed
source: Search failed. Please try again.
si: සෙවීම අසාර්ථක විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Failed to load recipes. Please try again.
si: වට්ටෝරු පූරණය කිරීම අසාර්ථක විය. කරුණාකර නැවත උත්සාහ කරන්න.

# noRecipesFoundEmpty
source: No recipes found
si: වට්ටෝරු හමු නොවීය

source: Try searching with different keywords
si: වෙනත් මූල පද සමඟ සෙවීම උත්සාහ කරන්න

source: No recipes available
si: වට්ටෝරු නොමැත

source: Please check back later
si: කරුණාකර පසුව නැවත පරීක්ෂා කරන්න

source: Clear search
si: සෙවීම මකන්න

source: Confirm Meal
si: ආහාරය තහවුරු කරන්න

# reviewMealDetails
source: Review your meal details
si: ඔබේ ආහාර විස්තර සමාලෝචනය කරන්න

source: Scheduled Time
si: නියමිත වේලාව

source: Change
si: වෙනස් කරන්න

source: Number of Servings
si: සේවා කිරීම් ගණන

# servingsLabel
source: Servings:
si: සේවා කිරීම්:

source: Meal Category
si: ආහාර කාණ්ඩය

source: Back to Recipes
si: ආපසු

# addToMealPlanAction
source: Add to Meal Plan
si: ආහාර සැලැස්මට එක් කරන්න

# addMealCategory
source: Add {category}
si: {category} එක් කරන්න

source: Loading...
si: පූරණය වෙමින්...

source: Unknown Recipe
si: නොදන්නා වට්ටෝරුව

source: Leftover Meal
si: ඉතිරි ආහාරය

source: Grocery List
si: සිල්ලර ගනුදෙනු ලැයිස්තුව

# weekOf
source: Week of {dateRange}
si: {dateRange} සතිය

source: No Grocery Items Generated
si: සිල්ලර ගනුදෙනු අයිතම උත්පාදනය වී නැත

# mealPlanNoIngredientsInfo
source: Your meal plan doesn't contain meals with ingredient information that can generate grocery items
si: ඔබගේ ආහාර සැලැස්ම සිල්ලර අයිතම උත්පාදනය කළ හැකි අමුද්‍රව්‍ය තොරතුරු සහිත ආහාර අඩංගු නොවේ

source: Add recipe-based meals
si: වට්ටෝරු පාදක ආහාර එක් කරන්න

# addRecipeBasedMealsDescription
source: Use the + button to add meals from your recipe collection
si: ඔබගේ වට්ටෝරු එකතුවෙන් ආහාර එක් කිරීමට + බොත්තම භාවිතා කරන්න

source: Ensure recipes have ingredients
si: වට්ටෝරුවලට අමුද්‍රව්‍ය ඇති බව සහතික කරන්න

# ensureRecipesHaveIngredientsDescription
source: Only recipes with ingredient lists can generate grocery items
si: අමුද්‍රව්‍ය ලැයිස්තු සහිත වට්ටෝරුවලට පමණක් සිල්ලර අයිතම උත්පාදනය කළ හැකිය

source: Generate your list
si: ඔබගේ ලැයිස්තුව උත්පාදනය කරන්න

# generateYourListDescription
source: Once you have recipe-based meals, try generating again
si: ඔබට වට්ටෝරු පාදක ආහාර ලැබුණු පසු, නැවත උත්පාදනය කිරීමට උත්සාහ කරන්න

# itemsAcrossCategories
source: {totalItems} items across {categoriesCount} categories
si: කාණ්ඩ {categoriesCount} කිහිපයක් පුරා අයිතම {totalItems}

source: Export
si: නිර්යාත කරන්න

source: Exporting...
si: නිර්යාත කරමින්...

source: Item Name
si: අයිතම නම

source: Quantity
si: ප්‍රමාණය

source: Unit
si: ඒකකය

source: Category
si: කාණ්ඩය

source: Save
si: සුරකින්න

source: Grocery list exported successfully!
si: සිල්ලර ගනුදෙනු ලැයිස්තුව සාර්ථකව නිර්යාත කරන ලදී!

# failedToExport
source: Failed to export: {error}
si: නිර්යාත කිරීමට අසමත් වීම: {error}

# itemRemoved
source: {itemName} removed
si: {itemName} ඉවත් කරන ලදී

source: Vegetables
si: එළවළු

source: Fruits
si: පලතුරු

source: Meat & Fish
si: මස් සහ මාළු

source: Dairy
si: කිරි නිෂ්පාදන

source: Grains & Rice
si: ධාන්‍ය සහ බත්

source: Oils & Condiments
si: තෙල් සහ කුළුබඩු

source: Spices
si: කුළුබඩු

source: Other
si: වෙනත්

source: Recipe Image
si: වට්ටෝරුවේ පින්තූරය

# availableIngredientsCount
source: {available}/{total} ingredients
si: අමුද්‍රව්‍ය {available}/{total}

source: Missing: {ingredients}
si: නොමැති: {ingredients}

# editItem
source: Edit {itemType}
si: {itemType} සංස්කරණය කරන්න

# addItem
source: Add {itemType}
si: {itemType} එකතු කරන්න

source: Item Type
si: අයිතම වර්ගය

source: Ingredient
si: අමුද්‍රව්‍ය

source: Leftover
si: ඉතුරු ආහාර

# itemNameLabel
source: {itemType} Name
si: {itemType} නාමය

# enterItemName
source: Enter {itemType} name...
si: {itemType} නාමය ඇතුළත් කරන්න...

# pleaseEnterItemName
source: Please enter an ingredient name
si: කරුණාකර අමුද්‍රව්‍ය නාමයක් ඇතුළත් කරන්න

# updateItem
source: Update {itemType}
si: {itemType} යාවත්කාලීන කරන්න

# addItemAction
source: Add {itemType}
si: {itemType} එකතු කරන්න

# findingRecipesEllipsis
source: Finding recipes...
si: වට්ටෝරු සොයමින්...

# recipesAvailable
source: {count, plural, =1{1 recipe} other{{count} recipes}} available
si: වට්ටෝරු {count}ක් ලබා ගත හැකිය

source: Recipe Suggestions
si: වට්ටෝරු යෝජනා

source: Failed to load recipe suggestions
si: වට්ටෝරු යෝජනා පූරණය කිරීම අසාර්ථක විය

# noMatchingRecipesFound
source: No matching recipes found for this leftover
si: මෙම ඉතිරි ආහාරය සඳහා ගැලපෙන වට්ටෝරු හමු නොවීය

source: Edit
si: සංස්කරණය කරන්න

# findingRecipesForLeftover
source: Finding recipes...
si: වට්ටෝරු සොයමින්...

source: Recipe suggestions ({count})
si: වට්ටෝරු යෝජනා ({count})

source: No recipes found
si: වට්ටෝරු හමු නොවීය

source: Tap to view recipes
si: වට්ටෝරු බැලීමට ක්ලික් කරන්න

source: Tap to hide recipes
si: වට්ටෝරු සැඟවීමට ක්ලික් කරන්න

source: Failed to load suggestions
si: යෝජනා පූරණය කිරීම අසාර්ථක විය

# noMatchingRecipesFoundForLeftover
source: No matching recipes found for this leftover
si: මෙම ඉතිරි ආහාරය සඳහා ගැලපෙන වට්ටෝරු හමු නොවීය

source: Recipes You Can Make
si: ඔබට සාදා ගත හැකි වට්ටෝරු

# recipesCountText
source: {count} recipes
si: වට්ටෝරු {count}ක්

# perfectCount
source: {count} perfect
si: සම්පූර්ණ {count}ක්

# goodCount
source: {count} good
si: හොඳ {count}ක්

source: Add More Ingredients
si: තවත් අමුද්‍රව්‍ය එක් කරන්න

# addMoreIngredientsDescription
source: We'll find recipes that match what you have! Add a few more ingredients to see recipe suggestions.
si: ඔබ සතුව ඇති දේට ගැලපෙන වට්ටෝරු අපි සොයා ගන්නෙමු! වට්ටෝරු යෝජනා බැලීමට තවත් අමුද්‍රව්‍ය කිහිපයක් එක් කරන්න.

# tryAddingSuggestion
source: Try adding: Rice, Onions, Garlic
si: මේ එක් කිරීමට උත්සාහ කරන්න: බත්, ළූණු, සුදුළූණු
